#first

#while loop ასრულებს კოდს პირობის შესრულებამდე და list ინახავს მრავალ მნიშვნელობას.

#second

num = 4
while num <= 84:
    if num != 6:
        print(num)
    num += 1

#third

#1. ვქმნით სიას.
fruits = ["apple", "banana", "orange", "android", "mango", "grape"]

#2. გამოვიტანოთ მე-2, მე-4 და მე-6 ელემენტები
print(fruits[1])
print(fruits[3])
print(fruits[5])

#fourth

# ცვლადი ინახავს ერთ კონკრეტულ მნიშვნელობას
age = 14      # ეს არის ცვლადი, სადაც ინახება მხოლოდ ერთი რიცხვი

# ლისტი ინახავს ბევრ მნიშვნელობას
ages = [12, 14, 18, 21]   # ეს არის სია, სადაც ერთზე მეტი რიცხვია შენახული
