#first
# List — ეს არის ელემენტების კოლექცია, რომელიც შეიძლება შეიცავდეს ასოებს, ციფრებს და სხვა ტიპის მონაცემებს.
# მაგალითად:
my_list = [1, 2, 3, 4, 5]
# Slicing — ნიშნავს სიის ან სტრიქონის ნაწილის ამოღებას ინდექსების გამოყენებით.
# ფორმა: my_list[start:end:step]


#second


letters = ["ა", "ბ", "გ", "დ", "ე", "ვ", "ზ", "თ", "ი", "კ"]


print("პირველი 5 ასო:", letters[0:5])

print("ბოლო 3 ასო:", letters[-3:])

print("უკუღმა:", letters[::-1])

print("მე-2 დან მე-6 ამდე:", letters[1:6])

#third 

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print("თითოეული მეორე ელემენტი:", numbers[::2])

print("ბოლო 4 ელემენტი უკუღმა:", numbers[-1:-5:-1])

#fourth

text = "დილამშვიდობისა"

print("დილა:", text[0:4])

print("მშვიდობისა:", text[4:])


