#first

# List (სია) — არის ელემენტების კოლექცია ერთ ცვლადში.
# სია იქმნება "[ ]"-ით.
# სია შეიძლება შეიცავდეს რიცხვებს, ასოებს, ტექსტებს და ა.შ.

numbers = [1, 2, 3, 4, 5]
letters = ["ა", "ბ", "გ", "დ"]

# შეგვიძლია კონკრეტული ელემენტის ამოღება:
print(numbers[0]) 
print(letters[2]) 

#second

# for ციკლი საშუალებას გვაძლევს გავიაროთ სიის ყველა ელემენტი ერთ-ერთად.

fruits = ["ვაშლი", "ბანანი", "მსხალი"]

for fruit in fruits:
    print(fruit)  


#third

print("ლუწი რიცხვები 22-დან 104-მდე:")
for i in range(22, 105):  
    if i % 2 == 0:       
        print(i)

print("კენტი რიცხვები 204-დან 426-მდე:")
for i in range(204, 427):
    if i % 2 != 0:        
        print(i)

#fourth
age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if age < 18:
    print("ჯერ არ ხართ 18 წლის")
else:
    print("თქვენ გადაცდით ასაკის ზღვარს")


